นโยบายความเป็นส่วนตัว NONFREE VPN
หน้านี้ใช้เพื่อแจ้งผู้เยี่ยมชมเกี่ยวกับนโยบายของเรา ในการรวบรวม การใช้ และการเปิดเผยข้อมูลส่วนบุคคล หากมีใครตัดสินใจใช้บริการของของเรา
หากคุณเลือกที่จะใช้บริการของเรา แสดงว่าคุณยอมรับการรวบรวมและการใช้ข้อมูลที่เกี่ยวข้องกับนโยบายนี้ ข้อมูลส่วนบุคคลที่เรา รวบรวมจะถูกนำมาใช้เพื่อการให้บริการและปรับปรุงบริการของเรา จะไม่ใช้หรือแบ่งปันข้อมูลของคุณกับใครก็ตาม ยกเว้นตามที่อธิบายไว้ในนโยบายความเป็นส่วนตัวนี้
ข้อกำหนดที่ใช้ในนโยบายความเป็นส่วนตัวนี้มีความหมายเดียวกับในข้อกำหนดและเงื่อนไขของเรา ซึ่งสามารถเข้าถึงได้ที่ NONFREE VPN เว้นแต่จะกำหนดไว้เป็นอย่างอื่นในนโยบายความเป็นส่วนตัวนี้

*การรวบรวมและการใช้ข้อมูล
เพื่อประสบการณ์ที่ดีขึ้น ในขณะที่ใช้บริการของเรา เราอาจขอให้คุณมอบข้อมูลที่สามารถระบุตัวตนส่วนบุคคลบางอย่างให้เราได้ ข้อมูลที่คำขอเรา จะถูกเก็บรักษาไว้ในอุปกรณ์ของคุณ และไม่ถูกรวบรวมโดยพวกเราแต่อย่างใด
แอปใช้บริการของบุคคลที่สามที่อาจรวบรวมข้อมูลที่ใช้ระบุตัวคุณ
ลิงก์ไปยังนโยบายความเป็นส่วนตัวของผู้ให้บริการบุคคลที่สามที่แอปใช้

•Google Play Services
•AdMob
•Google Analytics for Firebase
•Firebase Crashlytics
•One Signal

*บันทึกข้อมูล
เราต้องการแจ้งให้คุณทราบว่าเมื่อใดก็ตามที่คุณใช้บริการ ของเรา ในกรณีที่มีข้อผิดพลาดในแอปเรารวบรวมข้อมูลและข้อมูล (ผ่านผลิตภัณฑ์ของบุคคลที่สาม) บนโทรศัพท์ของคุณที่เรียกว่า Log ข้อมูล. ข้อมูลบันทึกนี้อาจรวมถึงข้อมูลต่างๆ เช่น ที่อยู่ Internet Protocol (“IP”) ของอุปกรณ์ของคุณ ชื่ออุปกรณ์ เวอร์ชันระบบปฏิบัติการ การกำหนดค่าของแอปเมื่อใช้บริการของเรา เวลาและวันที่ที่คุณใช้บริการ และสถิติอื่นๆ

*คุ้กกี้
คุกกี้คือไฟล์ที่มีข้อมูลจำนวนเล็กน้อยซึ่งมักใช้เป็นตัวระบุที่ไม่ระบุชื่อ สิ่งเหล่านี้จะถูกส่งไปยังเบราว์เซอร์ของคุณจากเว็บไซต์ที่คุณเยี่ยมชมและจัดเก็บไว้ในหน่วยความจำภายในของอุปกรณ์ของคุณ
บริการนี้ไม่ได้ใช้ "คุกกี้" เหล่านี้อย่างชัดเจน อย่างไรก็ตาม แอปอาจใช้โค้ดและไลบรารีของบุคคลที่สามที่ใช้ "คุกกี้" เพื่อรวบรวมข้อมูลและปรับปรุงบริการของพวกเขา คุณมีตัวเลือกที่จะยอมรับหรือปฏิเสธคุกกี้เหล่านี้ และรู้ว่าเมื่อใดที่คุกกี้จะถูกส่งไปยังอุปกรณ์ของคุณ หากคุณเลือกที่จะปฏิเสธคุกกี้ของเรา คุณอาจไม่สามารถใช้บริการบางส่วนได้

*ผู้ให้บริการ
เราอาจจ้างบริษัทและบุคคลภายนอกเนื่องจากเหตุผลดังต่อไปนี้:
เพื่ออำนวยความสะดวกในการบริการของเรา
เพื่อให้บริการในนามของเรา
เพื่อให้บริการที่เกี่ยวข้องกับบริการ หรือ
เพื่อช่วยเราวิเคราะห์วิธีการใช้บริการของเรา
เราต้องการแจ้งให้ผู้ใช้บริการนี้ทราบว่าบุคคลที่สามเหล่านี้สามารถเข้าถึงข้อมูลส่วนบุคคลของตนได้ เหตุผลก็คือเพื่อปฏิบัติงานที่ได้รับมอบหมายในนามของเรา อย่างไรก็ตาม พวกเขามีหน้าที่ที่จะไม่เปิดเผยหรือใช้ข้อมูลเพื่อวัตถุประสงค์อื่นใด

*ความปลอดภัย
เราให้ความสำคัญกับความไว้วางใจของคุณในการให้ข้อมูลส่วนบุคคลของคุณแก่เรา ดังนั้นเราจึงมุ่งมั่นที่จะใช้วิธีการปกป้องข้อมูลดังกล่าวที่เป็นที่ยอมรับในเชิงพาณิชย์ แต่โปรดจำไว้ว่าไม่มีวิธีการส่งข้อมูลทางอินเทอร์เน็ตหรือวิธีการจัดเก็บทางอิเล็กทรอนิกส์ใดที่ปลอดภัยและเชื่อถือได้ 100% และ เราไม่สามารถรับประกันความปลอดภัยได้อย่างสมบูรณ์

*ลิงค์ไปยังเว็บไซต์อื่น
บริการนี้อาจมีลิงก์ไปยังเว็บไซต์อื่น หากคุณคลิกลิงก์ของบุคคลที่สาม คุณจะถูกนำไปยังไซต์นั้น โปรดทราบว่าไซต์ภายนอกเหล่านี้ไม่ได้ดำเนินการโดยเราดังนั้น เราขอแนะนำอย่างยิ่งให้คุณตรวจสอบนโยบายความเป็นส่วนตัวของเว็บไซต์เหล่านี้ เราไม่มีการควบคุมและไม่รับผิดชอบต่อเนื้อหา นโยบายความเป็นส่วนตัว หรือหลักปฏิบัติของไซต์หรือบริการของบุคคลที่สาม

*ความเป็นส่วนตัวของเด็ก
บริการเหล่านี้ไม่ได้กล่าวถึงผู้ที่มีอายุต่ำกว่า 13 ปี เราจะไม่รวบรวมข้อมูลที่สามารถระบุตัวบุคคลได้จากเด็กอายุต่ำกว่า 13 ปีโดยเจตนา ในกรณีที่ เราพบว่าเด็กอายุต่ำกว่า 13 ปีได้ให้ข้อมูลส่วนบุคคลแก่เรา เราจะลบข้อมูลนี้ออกจากเซิร์ฟเวอร์ของเราทันที หากคุณเป็นพ่อแม่หรือผู้ปกครองและคุณทราบว่าบุตรหลานของคุณได้ให้ข้อมูลส่วนบุคคลแก่เรา โปรดติดต่อเราเพื่อให้เราดำเนินการที่จำเป็นได้

*การเปลี่ยนแปลงนโยบายความเป็นส่วนตัวนี้
เราอาจอัปเดตนโยบายความเป็นส่วนตัวของเราเป็นครั้งคราว ดังนั้น คุณควรตรวจสอบหน้านี้เป็นระยะๆ หากมีการเปลี่ยนแปลงใดๆ เราจะแจ้งให้คุณทราบถึงการเปลี่ยนแปลงใด ๆ โดยการโพสต์นโยบายความเป็นส่วนตัวใหม่ในหน้านี้
นโยบายนี้มีผลบังคับใช้ในวันที่ 2023-11-03

*ติดต่อเรา
หากคุณมีคำถามหรือข้อเสนอแนะเกี่ยวกับนโยบายความเป็นส่วนตัวของของเรา อย่าลังเลที่จะติดต่อของเรา ที่  bugnon1860@gmail.com
หน้านโยบายความเป็นส่วนตัวนี้สร้างขึ้นที่Privacypolicytemplate.netและแก้ไข/สร้างโดยเครื่องมือสร้างนโยบายความเป็นส่วนตัวของแอป